Repository: 84000/data-translation-memory
Catalog: toh54-v2.tmx
Source language: bo
Languages: en

source: བཟང་པོར་སྣང་བའི་བཻ་དཱུརྱ། །ལོག་པས་གྲུབ་པ་རྣམས་ཀྱང་བརྫུན། །
en: The beautiful glitter of beryl gems Is also false and untrue.

source: ཡང་དག་མིན་པས་ཀུན་བསྐྱེད་པས། །ལྷ་རྣམས་བརྫུན་པར་ཤེས་པས་ན། །
en: “Knowing that gods manifest in an unreal manner And are therefore unreal,

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །ལྷ་ཡི་གཟུགས་ཀྱིས་བསྟན་པ་ཡིན། །
en: This statement on the peace of absorption I have made with reference to the gods’ figures.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ལྷའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand gods’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ཀླུའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand nāgas’ figures to be absorption?

source: མི་བཟོད་བསྐྱེད་པ་བྱས་ནས་ནི། །ཡོད་མིན་སྤྲིན་གྱི་གཟུགས་བསྟན་ཅིང་། །
en: “By becoming intolerant, They manifest the forms of nonexistent clouds. Although they do not remain in those clouds,

source: ཆར་པའི་རྒྱུན་དག་རབ་འབེབས་པ། །
en: They bring down heavy rainfall.

source: དེ་དག་ནང་ན་མི་གནས་ཀྱང་། །འཛམ་བུའི་གླིང་འདིར་རྒྱ་མཚོ་དང་། །ཀླུང་དང་དུག་ཅན་ཡོངས་སུ་འགེངས། །
en: “They fill up the seas, Rivers, and oceans here in Jambudvīpa.

source: སྔོན་གྱི་མཐའ་འམ་ཕྱི་མའི་མཐར། །ཆུ་ནི་འབྱུང་བ་ཡོད་མ་ཡིན། །
en: Yet, whether in the beginning or the end, This water is devoid of origin.

source: དེ་དང་མཚུངས་པའི་སེམས་ཅན་ཀུན། །རྩོམ་པ་སྣ་ཚོགས་བསླབས་པ་རྣམས། །
en: “All beings are similar to that water— They are skilled in various undertakings

source: ལས་རྣམས་སྣ་ཚོགས་སྟོན་བྱེད་ཀྱང་། །ལས་དེ་འབྱུང་བ་ཡོད་མ་ཡིན། །
en: And display various karmic actions, But these karmic actions have no origin.

source: མཁས་པས་བྱིས་པ་རྨོངས་བྱེད་པའི། །སྒྱུ་འདི་མ་བྱུང་ཤེས་པས་ན། །
en: “The wise know these illusions, Which delude the immature, to be unarisen.

source: བདེན་པ་མ་ཡིན་བདེན་སྣང་བས། །ཀླུ་ནི་ཏིང་ངེ་འཛིན་དུ་བསྟན། །
en: Thus, since the untrue appears as true, I have taught nāgas to be absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ཀླུའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, that is how you should understand nāgas’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་གནོད་སྦྱིན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand yakṣas’ figures to be absorption?

source: སེམས་ནི་རྣམ་པར་གྱུར་པ་ལས། །འཇིགས་པའི་གཟུགས་ནི་མངོན་གྲུབ་པ། །
en: “From the transformation of the mind Manifests a terrifying figure.

source: ལུས་ཀྱི་བོང་ཚོད་ཆེ་བ་ཡང་། །སེམས་གཅིག་གིས་ནི་ཀུན་དུ་བསྐྱེད། །
en: Though its body may be great, It was created by a single mind.

source: སེམས་ལ་འཇིགས་པ་ཡོད་མིན་ཏེ། །
en: “Fear does not exist within the mind;

source: ཚོགས་པ་དག་ལས་འཇིགས་པ་སྐྱེ། །
en: It appears from a combination of factors.

source: ཡོད་པ་མིན་པའི་ལས་རྣམས་ལས། །མི་སྡུག་རྣམ་པ་བསམ་ཡས་ལྟོས། །
en: Look at the inconceivable array of hideous forms Arising out of nonexistent action!

source: མི་སྡུག་རྣམ་པ་བསམ་ཡས་པ། །ཤིན་ཏུ་སྟོང་པར་ཤེས་པས་ན། །
en: “Knowing this inconceivable array of hideous forms To be utterly empty,

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །གནོད་སྦྱིན་གཟུགས་ཀྱིས་བསྟན་པ་ཡིན། །
en: This statement on the peace of absorption I have made with reference to the yakṣas’ figures.

source: འཇམ་དཔལ་དེ་ལྟར་ན་གནོད་སྦྱིན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, that is how you should understand yakṣas’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་དྲི་ཟའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand gandharvas’ figures to be absorption?

source: ཆོས་དེ་ཤིན་དུ་འགྲོ་མེད་ཀྱང་། །འགྲོ་བའི་སྒྲར་ནི་བརྗོད་པས་ན། །
en: “Though these phenomena are devoid of any going, They are given the name of wanderers.

source: འགྲོ་བས་འགྲོ་བ་མེད་ཤེས་པས། །དྲི་ཟས་ཏིང་འཛིན་བསྟན་པ་ཡིན། །
en: Knowing wanderers to go nowhere, I have taught absorption with reference to gandharvas.

source: འཇམ་དཔལ་དེ་ལྟར་ན་དྲི་ཟའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand gandharvas’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ལྷ་མ་ཡིན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand asuras’ figures to be absorption?

source: ཨ་ཡི་རྒྱས་བཏབ་ལྷ་མིན་ཏེ། །
en: “The asura, sealed with the letter a,

source: སྐྱེ་བ་མེད་ལས་ཡང་དག་བྱུང་། །
en: Truly arises from the unborn.

source: འགག་མེད་འབྱུང་བ་ཡོད་མིན་པས། །ལྷ་མ་ཡིན་གྱིས་ཏིང་འཛིན་བསྟན། །
en: Since they are unceasing and non-arising, Absorption is taught with reference to the asuras.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ལྷ་མ་ཡིན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand asuras’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ནམ་མཁའ་ལྡིང་གི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand garuḍas’ figures to be absorption?

source: འཛིན་པ་མེད་ལ་འཛིན་བྱས་ནས། །
en: “Grasping onto the ungraspable,

source: བརྗོད་པས་མིང་དུ་བཏགས་པས་ན། །
en: We apply labels as we speak.

source: མིང་དང་གཟུགས་ནི་ཡོད་མིན་པས། །ནམ་མཁའ་ལྡིང་གིས་ཏིང་འཛིན་བསྟན། །
en: Since neither name nor form are existent, I have taught absorption with reference to the garuḍas.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ནམ་མཁའ་ལྡིང་གི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand garuḍas’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་མི་འམ་ཅིའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand kinnaras’ figures to be absorption?

source: བྱས་མིན་བྱས་པའི་ལས་རྣམས་ཀྱིས། །མི་འམ་ཅི་ཉིད་ཀུན་དུ་བསྐྱེད། །
en: “It is by uncreated, created actions That the kinnaras are produced.

source: འདི་དག་སྐྱེ་བ་མེད་ཤེས་པས། །མི་འམ་ཅི་ཡིས་ཏིང་འཛིན་བསྟན། །
en: Knowing them to be unborn, I have taught absorption with reference to the kinnaras.

source: འཇམ་དཔལ་དེ་ལྟར་ན་མི་འམ་ཅིའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand the kinnaras’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand mahoragas’ figures to be absorption?

source: མིང་གང་གིས་ནི་ཆོས་འདི་དག །འཇིག་རྟེན་དག་ཏུ་སྣ་ཚོགས་བཞག །
en: “By whatever names these phenomena Are variously posited in the worlds,

source: ཆོས་དེ་འདི་ལ་ཡོད་མ་ཡིན། །
en: The phenomena do not exist there;

source: མེད་ལས་ཐམས་ཅད་ཀུན་དུ་བརྟགས། །
en: Everything is imagined out of nonexistence.

source: ཀུན་དུ་བརྟགས་པར་ཀུན་ཤེས་ན། །
en: “If you know everything to be fabricated,

source: ངོ་བོ་ཉིད་ཀྱིས་ཀུན་རྟོག་མེད། །
en: There are naturally no concepts.

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་ཀྱིས་བསྟན། །
en: This statement on the peace of absorption I have made with reference to the mahoragas’ figures.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand mahoragas’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་དམྱལ་བའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand the hell beings’ figures to be absorption?

source: རྡུལ་དང་བྲལ་ཞིང་རྡུལ་མེད་གསོག །
en: “Stainless, pure, and hollow,

source: དེ་ལ་བྱེད་པོ་འགའ་ཡང་མེད། །
en: They have no maker whatsoever.

source: རང་གི་རྟོག་པས་ཀུན་བསྐྱེད་དེ། །
en: They are produced by their own thoughts,

source: རྟོག་པ་དེ་ཡང་ཡོད་མ་ཡིན། །
en: Which have no existence either.

source: དམྱལ་བ་དྲི་མེད་དྲི་བྲལ་ཞིང་། །དག་དང་ཡང་དག་འོད་གསལ་དང་། །
en: “Hell is clean, immaculate, Pure, true, and luminous.

source: མཚན་ཉིད་མེད་ཅིང་མཚན་མེད་པར། །བྱང་ཆུབ་སྙིང་པོར་ངས་ཤེས་ཏེ། །
en: It is beyond all characteristics and marks, Like the seat of awakening—thus I know.

source: མཚན་ཉིད་མེད་ཅིང་བྱུང་མེད་དེ། །ནམ་མཁའ་འདྲ་བར་ཤེས་པས་ན། །
en: “Knowing hell to be beyond attributes and unarisen, Similar to the sky,

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །སེམས་ཅན་དམྱལ་བའི་གཟུགས་ཀྱིས་བསྟན། །
en: This statement on the peace of absorption I have made with reference to the hell beings’ figures.

source: འཇམ་དཔལ་དེ་ལྟར་ན་སེམས་ཅན་དམྱལ་བའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand hell beings’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand figures in the animal realm to be absorption?

source: དཔེར་ན་ཇི་ལྟར་སྤྲིན་གྱི་གཟུགས། །ཁ་དོག་སྣ་ཚོགས་བྱུང་བ་དག །
en: “For instance, cloud formations Appear in various colors;

source: དེ་ལ་ཁ་དོག་ཡོད་མིན་ཡང་། །མི་མཁས་པ་དག་རྨོངས་པར་བྱེད། །
en: Though the clouds have no real color, They fool the unwise.

source: དེ་བཞིན་སེམས་ཀྱང་མེད་པའི་ཕྱིར། །སྤྲིན་གྱི་གཟུགས་དང་མཚུངས་འདྲ་ཡང་། །
en: “Likewise, since the mind does not exist It is like the form of a cloud:

source: དུད་འགྲོའི་སྐྱེ་གནས་རྣམས་སུ་ནི། །རྣམ་པ་སྣ་ཚོགས་ལུས་ཀྱང་སྟོན། །
en: In the realms of animals, It displays bodies in various forms.

source: ལས་ནི་སྒྱུ་མའི་རང་བཞིན་དང་། །བྱུང་མེད་མཚན་ཉིད་མེད་པར་ཤེས། །
en: “Karmic actions are of an illusory nature. I know them to be unarisen and beyond characteristics.

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །དུད་འགྲོའི་གཟུགས་ཀྱིས་བསྟན་པ་ཡིན། །
en: This statement on the peace of absorption I have made with reference to animals’ figures.

source: འཇམ་དཔལ་དེ་ལྟར་ན་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand figures in the animal realm to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand the figures in the world of the Lord of Death to be absorption?

source: ནག་པོ་དང་ནི་དཀར་པོ་ཡི། །སྡིག་དང་ཁ་ན་མ་ཐོ་དང་། །
en: “Black misdeeds and objectionable deeds And white irreproachable deeds

source: ཁ་ན་མ་ཐོ་མེད་པའི་ལས། །རབ་འབྲིང་ཐ་མ་འདྲེས་བྱས་པས། །
en: Have all become mixed up In terms of the best, the middling, and the worst.

source: གཤིན་རྗེའི་འཇིག་རྟེན་སྡུག་བསྔལ་ཞིང་། །ཚོལ་བར་ཀུན་དུ་འཁོར་བ་ཡིན། །
en: “Then, in the world of the Lord of Death, Beings suffer and spin around in confusion.

source: དེ་ལ་གཤིན་རྗེའི་འཇིག་རྟེན་མེད། །དེ་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་། །
en: Yet there is no realm of the Lord of Death— It is inherently empty.

source: རྨི་ལམ་ན་ནི་མྱོང་བ་བཞིན། །འཇུག་པ་མེད་ཅིང་གྲུབ་པ་མེད། །
en: “Like experiences in a dream, It is without beginning or completion.

source: གཤིན་རྗེའི་འཇིག་རྟེན་ཡོད་མིན་པས། །དེས་ན་ཏིང་ངེ་འཛིན་དུ་བསྟན། །
en: Since the realm of the Lord of Death is nonexistent, I have taught it to be absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand the figures in the world of the Lord of Death to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་འདོད་ཆགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand desire to be absorption?

source: ཡོངས་སུ་རྟོག་ལས་འདོད་ཆགས་འབྱུང་། །
en: “Desire surges from the imagination;

source: རྟོག་པ་དེ་ཡང་འབྱུང་བ་མེད། །
en: Those fancies too are unarisen.

source: འབྱུང་བ་མེད་ལ་གནས་པ་མེད། །
en: That which has no arising has no abiding—

source: དེ་ཡི་གནས་ཀྱང་རྙེད་མི་འགྱུར། །
en: Its location can never be determined.

source: གནས་མེད་གནས་པ་ཡོད་མིན་པས། །འདོད་ཆགས་ནམ་མཁའ་འདྲ་བ་ཡིན། །
en: “Since it does not abide and has no location, Desire is like the sky.

source: བྱིས་པ་བསླད་པར་གྱུར་རྣམས་ཀྱིས། །ཀུན་ནས་ཉོན་མོངས་ཡོངས་སུ་བརྟགས། །
en: Yet immature defiled beings Imagine it to be affliction.

source: ཀུན་ནས་ཉོན་མོངས་མེད་ཆོས་དེ། །
en: “This phenomenon, which knows no affliction,

source: འདོད་ཆགས་ཞེས་བྱའི་མིང་གིས་བརྗོད། །
en: Is then designated by the word desire.

source: ཕྱོགས་བཅུ་དག་ཏུ་བཙལ་བྱས་ཀྱང་། །དེ་ཡི་དངོས་པོ་རྙེད་མི་འགྱུར། །
en: Were one to search in all ten directions, One would not find its substance.

source: འདོད་ཆགས་དངོས་པོ་མེད་པ་ལ། །བྱིས་པ་རྨོངས་པ་འཇིགས་བྱེད་དེ། །
en: “This insubstantial desire Is feared by confused, childish beings.

source: འཇིགས་མེད་འཇིགས་པའི་འདུ་ཤེས་ཅན། །དེ་དག་ལ་ནི་བདེ་བ་མེད། །
en: Those who fear where there is no danger Can know no happiness.

source: ཇི་ལྟར་སྐྱེས་བུ་ལ་ལ་དག །
en: “For instance, some people

source: མཁའ་ལ་འཇིགས་པར་འདུ་ཤེས་ནས། །
en: Might perceive the sky as something frightening.

source: སྐྲག་ཅིང་བདག་གིས་ནམ་མཁའ་ནི། །མི་མཐོང་བྱ་ཞེས་འབྲོས་བྱེད་ཀྱང་། །
en: Terrified, they will run away, exclaiming, ‘I must not see the sky!’

source: ནམ་མཁས་ཀུན་དུ་ཁྱབ་པས་ན། །སུ་ཡང་དེ་ལས་མི་ཐར་ཏེ། །
en: “Yet, since space is omnipresent, No one can be free from it.

source: བྱིས་པ་བསླད་པར་གྱུར་རྣམས་ཀྱིས། །ཕྱིན་ཅི་ལོག་ཏུ་རྣམ་པར་བརྟགས། །
en: Corrupted, immature beings Imagine it falsely.

source: དེ་ལྟར་ཆོས་རྣམས་མཁའ་འདྲ་བར། །ཤེས་པར་མ་གྱུར་བྱིས་པ་རྣམས། །
en: “Thus, childish beings who do not know Phenomena to be like the sky

source: དངོས་པོ་མེད་པའི་འདོད་ཆགས་ལ། །ཡོངས་སུ་སྤང་བར་མངོན་པར་འདོད། །
en: Yearn to rid themselves Of insubstantial desire.

source: འདོད་ཆགས་ནམ་མཁའ་འདྲ་བས་ན། །
en: “Since desire is like the sky

source: སུ་ཡང་དེ་ལས་གྲོལ་བ་མེད། །
en: No one can be freed from it.

source: གྲོལ་ཞིང་རྣམ་གྲོལ་ཕུན་སུམ་ཚོགས། །ཆོས་རྣམས་མྱ་ངན་འདས་དང་འདྲ། །
en: Perfectly freed and liberated, Phenomena are like nirvāṇa.

source: སངས་རྒྱས་གང་དག་འདས་པ་དང་། །འདྲེན་པ་གང་དག་བཞུགས་པ་དང་། །
en: “The buddhas of the past, The guides of the present,

source: གང་དག་འབྱུང་འགྱུར་རྫོགས་སངས་རྒྱས། །དེ་ཀུན་སྤྱོད་ཡུལ་འདོད་ཆགས་ཡིན། །
en: And the perfect buddhas yet to come All have desire as their domain of experience.

source: འདོད་ཆགས་སྟོང་པར་ཤེས་གྱུར་ན། །
en: “When you have known desire to be empty,

source: ཆགས་ལས་གྲོལ་བ་གང་ཡང་མེད། །
en: There is no deliverance from it whatsoever.

source: གང་དག་ཆགས་ལ་འཇིགས་འདུ་ཤེས། །དེ་དག་ཆགས་ལས་གྲོལ་བྱར་སེམས། །
en: It is those who perceive desire as something frightening Who think they must free themselves from it.

source: ཅི་ཡང་མེད་པའི་མཐའ་འདི་ནི། །འདོད་ཆགས་མཐའ་སྟེ་འོད་གསལ་ཞིང་། །
en: “Being a limit of nothing whatsoever, The limit of desire is luminosity.

source: མཚན་མ་མེད་ལ་རྟག་མཉམ་པར། །བྱང་ཆུབ་སྙིང་པོར་ང་ཡིས་མཐོང་། །
en: As it is without characteristics, permanent, and sameness— I see it as the seat of awakening.

source: དངོས་པོར་འདུ་ཤེས་སེམས་ཅན་གང་། །དེ་དག་འདོད་ཆགས་འབྲི་བར་འགྱུར། །
en: “Beings who perceive it as existent Aim to diminish desire.

source: ཡོད་པ་མིན་པ་ཡོངས་བརྟགས་པས། །དེ་དག་གིས་ནི་སྤོང་བ་བརྟགས། །
en: Imagining the nonexistent, They imagine its abandonment.

source: བདག་གིས་འདོད་ཆགས་སྤང་བྱ་ཞེས། །དེ་འདྲའི་འདུ་ཤེས་སྐྱེས་ནས་ནི། །
en: “ ‘I must abandon desire’— Giving rise to such a conception,

source: དེ་ལ་སྤངས་ཞེས་བརྗོད་པར་བྱ། །
en: They would speak of its abandonment;

source: འགྲོ་བ་འདི་དག་འདུ་ཤེས་ཙམ། །འདོད་ཆགས་མཐའ་ནི་བསམ་ཡས་ཏེ། །
en: But such is these beings’ mere conception. “The limit of desire defies thought

source: མཐའ་དེ་འཇིག་པ་མེད་པས་ན། །
en: And is indestructible.

source: ཡང་དག་མཐའ་དང་དེ་མཉམ་པས། །དེ་ལས་གྲོལ་བར་མ་རྟོགས་ཤིག །
en: Thus it is equal to the limit of reality. So, do not think of being freed from it!

source: གལ་ཏེ་ཆགས་ལས་གྲོལ་གྱུར་ན། །སྟོང་པ་ཉིད་ལས་གྲོལ་བར་འགྱུར། །
en: “If one were freed from desire, One would be freed from emptiness.

source: འདོད་ཆགས་དང་ནི་སྟོང་པ་ཉིད། །དེ་གཉིས་གཉིས་སུ་ཡོད་མ་ཡིན། །
en: Desire and emptiness Are not two separate things.

source: འདི་ལྟར་སྐྱེ་བ་མེད་པ་ལ། །དེ་དག་སྐྱེ་བར་རྣམ་བརྟགས་པས། །
en: “In this way, these beings imagine The birth of the unborn.

source: བྱིས་པ་གཉིས་སུ་ཤེས་རྣམས་ལ། །ངས་ནི་སྤོང་བ་རབ་ཏུ་བསྟན། །
en: Therefore, to such immature beings whose consciousness is dualistic, I have taught abandonment.

source: འདོད་ཆགས་དེ་ནི་སྐྱེ་མེད་ན། །འདོད་ཆགས་ཤེས་བྱའི་མིང་དུ་བརྗོད། །
en: “Since it is unborn, Desire is just a label.

source: མིང་རྣམས་ཀུན་དུ་ཆགས་མེད་པས། །མིང་ལ་སུ་ཡང་ཆགས་པ་མེད། །
en: Names have no desire, And no one at all is attached to a name.

source: འདོད་ཆགས་ཆགས་པ་མེད་ཤེས་ཤིང་། །མཐའ་ལས་འདས་པའི་སྟོང་མཐོང་ན། །
en: “Knowing desire to be without attachment, And seeing it as limitless emptiness,

source: འདོད་ཆགས་རྣམ་པར་གཞིག་པའི་ཕྱིར། །ཐར་པ་མཁས་པས་མི་མཐོང་ངོ་། །
en: The wise do not see liberation As a way to eliminate desire.

source: འདོད་ཆགས་སངས་རྒྱས་ཆོས་མཚུངས་ཤིང་། །མྱ་ངན་འདས་པ་འདྲར་ཤེས་ནས། །
en: “Knowing that desire is like the qualities of awakening, And like nirvāṇa,

source: རྡུལ་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན། །འདོད་ཆགས་སྒྲས་ནི་ངས་བསྟན་ཏོ། །
en: I have taught immaculate absorption With reference to the word desire.

source: ཞི་བའི་དབྱིངས་ལ་རྟེན་པ་ཡིན། །འདོད་ཆགས་རབ་ཏུ་ཞི་ཤེས་ནས། །
en: “Desire rests on the sphere of peace. Knowing it to be complete peace,

source: མཁས་པ་རྣམས་ལ་ང་ཡིས་ནི། །ཏིང་འཛིན་འདོད་ཆགས་སྒྲར་བསྟན་ཏོ། །
en: To the wise ones I have taught Absorption with reference to the word desire.

source: འཇམ་དཔལ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་འདོད་ཆགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how bodhisattvas should understand desire to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ཞེ་སྡང་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand anger to be absorption?

source: སྤོང་ལས་ཞེ་སྡང་ཀུན་དུ་འབྱུང་། །
en: “As anger comes from rejecting,

source: ཉོན་མོངས་པ་ཡང་རྐྱེན་ལས་སྐྱེ། །
en: It is also an affliction born from conditions.

source: བདག་མེད་པ་ལས་བྱུང་བའི་བདག །མང་པོའི་ཚོགས་ལས་སྐྱེས་པ་ཡིན། །
en: This self, which has arisen from a lack of self, Comes about through the aggregation of many things.

source: རྩུབ་པོའི་སྒྲ་ལས་ཞེ་སྡང་ནི། །དུག་རྣོན་ལྟ་བུ་ཀུན་དུ་འབྱུང་། །
en: “Anger at harsh words Comes about like lethal poison.

source: སྒྲ་ནི་ང་རོའི་རང་བཞིན་པས། །ཤིན་དུ་ཡོད་པ་མ་ཡིན་ནོ། །
en: Words are simply the nature of sound And therefore completely nonexistent.

source: ཇི་ལྟར་ཚོགས་པས་གཙུབ་ཤིང་དང་། །གཙུབ་སྟན་ལས་ནི་མེ་བྱུང་སྟེ། །
en: “For instance, fire is kindled through the meeting

source: ཚོགས་དང་བྲལ་བར་གྱུར་ན་ནི། །
en: Of the grinding stick and grinding support.

source: དེ་ན་མེ་ཡང་ཡོད་མིན་ལྟར། །དེ་བཞིན་ཡིད་དུ་མི་འོང་བའི། །
en: Without these materials coming together, Fire cannot be.

source: སྒྲ་ལས་ཞེ་སྡང་གསོག་འབྱུང་ཞིང་། །གསོག་གི་སྒྲ་ལས་ཡང་བརྟགས་ན
en: “Likewise, from unpleasant words Arises vain anger;

source: དེ་ལ་ཞེ་སྡང་རྙེད་མི་འགྱུར། །
en: But if you examine these hollow words,

source: ཞེ་སྡང་སྒྲ་ལས་མ་བྱུང་ཞིང་། །ནང་ནའང་གནས་པ་མ་ཡིན་ལ། །
en: You will find no anger there. “Anger does not come from words.

source: ཞེ་སྡང་ཕྱི་རོལ་མ་འོངས་ཏེ། །བྱུང་བ་མེད་པས་གསོག་ཡིན་ནོ། །
en: It does not reside inside, Nor does anger arise from the outside—

source: རྒྱུ་རྣམས་ཕན་ཚུན་འདུས་པ་ལས། །ཞེ་སྡང་ཀུན་དུ་བྱུང་བ་ཡིན། །
en: Since it is without origination, it is hollow.

source: ཕན་ཚུན་བྲལ་བར་གྱུར་ན་ནི། །དེ་ལ་ཞེ་སྡང་རྙེད་མི་འགྱུར། །
en: “The coming together of causes Is the source of anger. If the causes come apart, Anger is nowhere to be found.

source: ཇི་ལྟར་ཞོ་དང་འོ་མ་ལ། །སྐྱེས་བུས་བཙལ་ཏེ་སྲུབ་ཤིང་གིས། །
en: “People may seek Curd and milk, churn it with a stick,

source: བསྲུབ་པ་བྱས་པས་རྐྱེན་རྣམས་ལས། །མར་ནི་ཀུན་དུ་བྱུང་བ་ལྟར། །
en: And create the conditions For butter to appear.

source: དེ་བཞིན་ཡིད་དུ་མི་འཐད་པའི། །སྒྲ་ལས་ཞེ་སྡང་གསོག་འབྱུང་ཞིང་། །
en: “Likewise, unpleasant words Are sources of hollow anger:

source: ཡོངས་སུ་བརྟགས་པས་དེ་གནས་ལ། །མི་མཁས་པ་དག་རབ་ཏུ་འབར། །
en: Because of their illusions, The unwise get fired up about them.

source: ཀུན་ཏུ་བརྟགས་པས་ཞེ་སྡང་ནི། །ཤིན་དུ་དངོས་མེད་ཤེས་པས་ན། །
en: “Knowing anger to be caused by imputation, And therefore utterly insubstantial,

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །ཞེ་སྡང་སྒྲ་ཡིས་རབ་ཏུ་བསྟན། །
en: I have made this statement on the peace of absorption With reference to the word anger.

source: ཞེ་སྡང་ཡང་དག་མཐའ་དང་མཉམ། །དེ་བཞིན་ཉིད་ལ་རྟེན་པ་ཡིན། །
en: “Knowing anger to be equal to the limit of reality, Rooted in suchness,

source: ཆོས་ཀྱི་དབྱིངས་དང་འདྲར་ཤེས་པས། །དེས་ན་ཏིང་ངེ་འཛིན་ཅེས་བསྟན། །
en: And similar to the realm of phenomena, I have taught about absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ཞེ་སྡང་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand anger to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་གཏི་མུག་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand delusion to be absorption?

source: མ་རིག་པ་ལས་གཏི་མུག་བྱུང་། །
en: “Delusion comes from ignorance;

source: མ་རིག་པ་ཡང་ཡོད་མ་ཡིན། །
en: Ignorance too is nonexistent.

source: གང་ན་གཏི་མུག་ཡོད་མིན་པ། །དེ་ན་གང་ཡང་རྨོངས་པ་མེད། །
en: Where there is no delusion, There can be no confusion.

source: རྨོངས་མེད་སེམས་ཅན་རྨོངས་གྱུར་ཅིང་། །ཆགས་མེད་ཆགས་པར་འདུ་ཤེས་པ། །
en: “Beings confuse what is without confusion, And perceive attachment where there is none.

source: ཇི་ལྟར་བྱིས་པས་ནམ་མཁའ་ལ། །མདུད་པ་བོར་བས་གསོག་བཞིན་ནོ། །
en: This is just like a childish being Vainly trying to tie a knot in space.

source: ཡོད་པ་མ་ཡིན་ཆོས་རྣམས་ལ། །ཀུན་ནས་ཉོན་མོངས་རྣམ་བཏགས་པ། །
en: “Labeling nonexistent phenomena As defilements:

source: བྱིས་པ་རྣམས་ཀྱི་འདི་མཚར་ཏེ། །མཆོག་ཏུ་ཤིན་དུ་བྱ་བར་དཀའ། །
en: This [problem] of childish beings is outrageous. It is indeed the most heinous of evil deeds.

source: ཇི་ལྟར་སྐྱེས་བུ་ལ་ལ་ཞིག །ནམ་མཁའ་ལ་ནི་འཇལ་བྱེད་ཅིང་། །
en: “Just as someone May examine the sky

source: བསྐལ་པ་བྱེ་བར་གཞལ་བྱས་ཀྱང་། །དེ་ལ་ཕུང་པོ་མི་རྙེད་ལྟར། །
en: For ten million eons And find no aggregates in it—

source: དེ་བཞིན་རྨོངས་པས་བྱིས་པ་ཡི། །སྔོན་གྱི་མཐའ་ནི་བསམ་མི་ཁྱབ། །
en: “Likewise, due to confusion The origin of immature beings is inconceivable.

source: གཏི་མུག་ཕུང་པོར་འབྱུང་མེད་དེ། །
en: Ignorance does not heap up—

source: དེས་ནི་ཅི་ཡང་བཀང་བ་མེད། །
en: It cannot fill anything up.

source: ཇི་ལྟར་ནམ་མཁའ་གཞལ་བྱས་ཀྱང་། །དེ་ལ་སྔོན་གྱི་མཐའ་མེད་ཅིང་། །
en: “One may try to measure the sky, But it has no beginning.

source: དེ་ན་ཅི་ཡང་བཀང་བ་མེད། །གཞལ་བར་ནུས་པ་མེད་པ་ལྟར། །
en: The sky cannot be filled by anything: It is immeasurable.

source: དེ་བཞིན་བསྐལ་པ་སྟོང་རྣམས་སུ། །ཀུན་དུ་རྨོངས་པས་དགང་བྱས་ཀྱང་། །
en: “Likewise, for thousands of eons Beings have been filled with ignorance; Still,

source: དེ་ལ་བཀང་བ་ཅི་ཡང་མེད། །ངོམས་པའང་ཅུང་ཟད་ཡོད་མ་ཡིན། །
en: they are never being filled, And they are never satisfied in the slightest.

source: ཇི་ལྟར་སྐྱེས་བུ་ལ་ལ་ཡིས། །སྦུད་པ་སྟོང་པ་བུད་བྱས་ཤིང་། །
en: “When a person who uses a bellow First empties it, expelling its air,

source: བཞག་ནས་སྦུད་པ་རྙོངས་པ་ན། །དེ་ཡི་ནང་ན་རྙེད་མིན་ལྟར། །
en: and Having compressed it, opens it up again, Nothing is to be found inside it.

source: དེ་བཞིན་འདོད་པ་སྦུད་འདྲ་བ། །ཀུན་དུ་རྨོངས་པས་སྤྱོད་པར་བྱེད། །
en: “Likewise, desire is like a bellow: Those who act out of delusion

source: དེ་ནི་ངོམས་པར་མི་འགྱུར་ཏེ། །
en: Can never find satisfaction,

source: ཕྱིར་ཞིང་འདོད་པ་ཚོལ་བར་བྱེད། །
en: But only pursue further desires.

source: གཏི་མུག་ཡོད་པ་མིན་ཞེས་བརྗོད། །
en: “Ignorance is said to be nonexistent:

source: རྩ་བ་ཆད་ཅིང་དངོས་པོ་མེད། །
en: It is uprooted and insubstantial,

source: རྩ་བ་མེད་ཅིང་གནས་ཀྱང་མེད། །
en: Rootless and without location;

source: དེས་ན་གཏི་མུག་ཟད་པ་མེད། །
en: Therefore, ignorance is inexhaustible.

source: འདི་ལྟར་གཏི་མུག་མི་ཟད་པས། །དེ་ཡི་མཐའ་མ་རྙེད་མི་འགྱུར། །
en: “Since ignorance is inexhaustible, Its end cannot be found.

source: དེ་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ལ། །ཟད་པར་བྱ་བར་ངས་མི་ནུས། །
en: Therefore, I cannot make it disappear For all sentient beings.

source: གལ་ཏེ་དཔེ་ཙམ་བརྗོད་བྱ་ན། །
en: “To make an analogy,

source: བསྐལ་པ་བྱེ་བ་བསམ་ཡས་སུ། །ང་ཡི་ཚེ་ནི་གནས་གྱུར་ལ། །
en: Even if I were to remain alive For inconceivably many tens of millions of eons

source: ཉིན་གཅིག་བཞིན་དུ་ཉིན་རེ་ལ། །སྟོང་གསུམ་སེམས་ཅན་ཇི་སྙེད་པ། །
en: And every single day “Cause as many beings as there are in a trichiliocosm

source: ཐམས་ཅད་མྱ་ངན་བཟླ་བྱས་ཞིང་། །ཐམས་ཅད་དེ་ལྟར་བྱས་ཀྱང་ནི། །
en: To pass into nirvāṇa, Though I may succeed in this,

source: སེམས་ཅན་ཁམས་ལ་ཟད་པ་མེད། །གཏི་མུག་གིས་ནི་བསྐྱེད་པའི་ཁམས། །
en: The realms of beings would still not be depleted. “Created by ignorance,

source: སེམས་ཅན་ཁམས་ལ་མཚན་ཉིད་མེད། །
en: The realms of beings are without marks.
